example-site/content-org/all-posts.org
#+HUGO_BASE_DIR: ../
#+OPTIONS: loffset:1
#+SEQ_TODO: TODO DRAFT DONE

** Menu Meta Data in TOML Front Matter
:PROPERTIES:
:EXPORT_FILE_NAME: menu-alist-meta-data-toml
:EXPORT_DATE: 2017-07-18
:EXPORT_HUGO_MENU: :menu "something here" :weight 80 :parent posts :identifier foo1
:END:
Testing the addition of /menu/ alist meta data to the TOML front
matter.
*** Overriding few menu properties
:PROPERTIES:
:EXPORT_FILE_NAME: menu-alist-meta-data-toml-override-partial
:EXPORT_DATE: 2017-07-18
:EXPORT_HUGO_MENU_OVERRIDE: :weight 10 :identifier ov-partial
:END:
For this post, we should see just the menu /weight/ and /identifier/
properties get overridden.

You need to set unique menu identifiers, else you get a Hugo error
like this:
#+BEGIN_EXAMPLE
ERROR 2017/07/18 12:32:14 Two or more menu items have the same name/identifier in Menu "main": "menu-meta-data-in-yaml-front-matter".
Rename or set an unique identifier.
#+END_EXAMPLE
*** Overriding menu properties completely
:PROPERTIES:
:EXPORT_FILE_NAME: menu-alist-meta-data-toml-override-full
:EXPORT_DATE: 2017-07-18
:EXPORT_HUGO_MENU: :menu test :weight 50
:END:
For this post, we see that no menu properties are inherited from the
parent; only the menu properties set in his subtree are effective.
