example-site/content/posts/menu-alist-meta-data-toml.md
+++
title = "Menu Alist Meta Data in TOML Front Matter"
date = 2017-07-18
tags = ["menu"]
draft = false
[menu.main]
  parent = "posts"
  weight = 80
  identifier = "foo1"
+++

Testing the addition of *menu* alist meta data to the TOML front matter.


## Overriding few menu properties {#overriding-few-menu-properties}

For this post, we should see just the menu *weight* and *identifier* properties get overridden.

You need to set unique menu identifiers, else you get a Hugo error like this:

    ERROR 2017/07/18 12:32:14 Two or more menu items have the same name/identifier in Menu "main": "menu-meta-data-in-yaml-front-matter".
    Rename or set an unique identifier.


## Overriding menu properties completely {#overriding-menu-properties-completely}

For this post, we see that no menu properties are inherited from the parent; only the menu properties set in his subtree are effective.
